# ✅ utils/emotion_labels.py
label_map = {
    0: "갈망", 1: "감사", 2: "걱정", 3: "공감", 4: "공포", 5: "괴로움",
    6: "그리움", 7: "기쁨", 8: "놀람", 9: "당황", 10: "답답", 11: "당혹",
    12: "두려움", 13: "분노", 14: "불안", 15: "비참", 16: "사랑", 17: "상처",
    18: "상실", 19: "서운", 20: "설렘", 21: "슬픔", 22: "스트레스", 23: "실망",
    24: "신남", 25: "억울", 26: "외로움", 27: "우울", 28: "의심", 29: "자괴감",
    30: "죄책감", 31: "창피", 32: "충격", 33: "쾌감", 34: "편안", 35: "후련함",
    36: "희망", 37: "희열", 38: "혐오", 39: "혼란", 40: "기대", 41: "무서움",
    42: "좌절", 43: "흥미"
}